LTG2012/xiaozhi-esp32-echoear/main/boards/echoear/EchoEar.cc
        // 读取电流 (0x0C-0x0D)
        ReadRegs(0x0C, read_buffer_, 2);
        current_ = static_cast<int16_t>(read_buffer_[1] << 8 | read_buffer_[0]);

        // 读取电量百分比 SOC (0x2C-0x2D)
        ReadRegs(0x2C, read_buffer_, 2);
        battery_level_ = read_buffer_[0];  // SOC 低字节就是百分比
        if (battery_level_ > 100) {
            battery_level_ = 100;
        }

        // 读取温度
        ESP_ERROR_CHECK(temperature_sensor_get_celsius(temp_sensor, &tsens_value));

        ESP_LOGD(TAG, "Battery: voltage=%dmV, current=%dmA, SOC=%d%%", voltage_, current_, battery_level_);
    }

    // 获取电量百分比 (0-100)
    uint8_t GetBatteryLevel()
    {
        return battery_level_;
    }

    // 判断是否在充电 (电流 > 0 表示充电)
    bool IsCharging()
    {
        return current_ > 0;
    }

    // 判断是否在放电 (电流 < 0 表示放电)
    bool IsDischarging()
    {
        return current_ < 0;
    }

    // 获取电压 (mV)
    uint16_t GetVoltage()
    {
        return voltage_;
    }

    // 获取电流 (mA，正值表示充电，负值表示放电)
    int16_t GetCurrent()
    {
        return current_;
    }

    static void TaskFunction(void *pvParameters)
    {
        Charge* charge = static_cast<Charge*>(pvParameters);
        while (true) {
            charge->ReadBatteryData();
            vTaskDelay(pdMS_TO_TICKS(1000));  // 每秒读取一次
        }
    }

private:
    uint8_t* read_buffer_ = nullptr;
    uint8_t battery_level_ = 0;   // 电量百分比
    uint16_t voltage_ = 0;        // 电压 (mV)
    int16_t current_ = 0;         // 电流 (mA)
};

#if SOC_TOUCH_SENSOR_SUPPORTED
class CopperTouchButton {
public:
    CopperTouchButton() = default;

    bool Initialize()
    {
        event_queue_ = xQueueCreate(kEventQueueLength, sizeof(TouchEvent));
        if (event_queue_ == nullptr) {
            ESP_LOGE(TAG, "Failed to create copper touch queue");
            return false;
        }

        if (xTaskCreatePinnedToCore(TaskFunction, "copper_touch_task", 4 * 1024,
                                    this, 5, &task_handle_, 1) != pdPASS) {
            ESP_LOGE(TAG, "Failed to create copper touch task");
            Deinitialize();
            return false;
        }

        static touch_sensor_sample_config_t sample_cfg[TOUCH_SAMPLE_CFG_NUM] = {
#if SOC_TOUCH_SENSOR_VERSION == 2
            TOUCH_SENSOR_V2_DEFAULT_SAMPLE_CONFIG(
                500, TOUCH_VOLT_LIM_L_0V5, TOUCH_VOLT_LIM_H_2V2),
#else
#error "EchoEar copper touch implementation currently targets touch sensor v2"
#endif
        };

        touch_sensor_config_t sens_cfg =
            TOUCH_SENSOR_DEFAULT_BASIC_CONFIG(TOUCH_SAMPLE_CFG_NUM, sample_cfg);
        if (touch_sensor_new_controller(&sens_cfg, &sens_handle_) != ESP_OK) {
            ESP_LOGE(TAG, "Failed to create copper touch controller");
            Deinitialize();
            return false;
        }

        touch_channel_config_t chan_cfg = {};
#if SOC_TOUCH_SENSOR_VERSION == 2
        chan_cfg.active_thresh[0] = 2000;
        chan_cfg.charge_speed = TOUCH_CHARGE_SPEED_7;
        chan_cfg.init_charge_volt = TOUCH_INIT_CHARGE_VOLT_DEFAULT;
#endif
        if (touch_sensor_new_channel(sens_handle_, TOUCH_PAD1, &chan_cfg,
                                     &chan_handle_) != ESP_OK) {
            ESP_LOGE(TAG, "Failed to create copper touch channel");
            Deinitialize();
            return false;
        }

        touch_sensor_filter_config_t filter_cfg =
            TOUCH_SENSOR_DEFAULT_FILTER_CONFIG();
        filter_cfg.data.debounce_cnt = 4;
        filter_cfg.data.active_hysteresis = 8;
        if (touch_sensor_config_filter(sens_handle_, &filter_cfg) != ESP_OK) {
            ESP_LOGW(TAG, "Failed to configure copper touch filter");
        }

        if (touch_sensor_enable(sens_handle_) != ESP_OK) {
            ESP_LOGE(TAG, "Failed to enable copper touch controller");
            Deinitialize();
            return false;
        }
        enabled_ = true;

        for (int i = 0; i < kCalibrationScanTimes; ++i) {
            if (touch_sensor_trigger_oneshot_scanning(sens_handle_, 1000) != ESP_OK) {
                ESP_LOGE(TAG, "Copper touch calibration scan failed");
                Deinitialize();
                return false;
            }
        }

        uint32_t baseline[TOUCH_SAMPLE_CFG_NUM] = {0};
        touch_chan_data_type_t baseline_type = TOUCH_CHAN_DATA_TYPE_SMOOTH;
#if SOC_TOUCH_SUPPORT_BENCHMARK
        baseline_type = TOUCH_CHAN_DATA_TYPE_BENCHMARK;
#endif
        if (touch_channel_read_data(chan_handle_, baseline_type, baseline) != ESP_OK) {
            ESP_LOGE(TAG, "Failed to read copper touch baseline");
            Deinitialize();
            return false;
        }

        if (touch_sensor_disable(sens_handle_) != ESP_OK) {
            ESP_LOGE(TAG, "Failed to disable copper touch controller");
            Deinitialize();
            return false;
        }
        enabled_ = false;

        for (int i = 0; i < TOUCH_SAMPLE_CFG_NUM; ++i) {
            uint32_t dynamic_thresh = baseline[i] / kThresholdDivisor;
            if (dynamic_thresh < kMinThreshold) {
                dynamic_thresh = kMinThreshold;
            }
            chan_cfg.active_thresh[i] = dynamic_thresh;
        }

        if (touch_sensor_reconfig_channel(chan_handle_, &chan_cfg) != ESP_OK) {
            ESP_LOGE(TAG, "Failed to reconfigure copper touch threshold");
            Deinitialize();
            return false;
        }

        touch_event_callbacks_t callbacks = {
            .on_active = OnTouchActive,
            .on_inactive = OnTouchInactive,
        };
        if (touch_sensor_register_callbacks(sens_handle_, &callbacks, this) != ESP_OK) {
            ESP_LOGE(TAG, "Failed to register copper touch callbacks");
            Deinitialize();
            return false;
        }

        if (touch_sensor_enable(sens_handle_) != ESP_OK) {
            ESP_LOGE(TAG, "Failed to enable copper touch controller (final)");
            Deinitialize();
            return false;
        }
        enabled_ = true;

        if (touch_sensor_start_continuous_scanning(sens_handle_) != ESP_OK) {
            ESP_LOGE(TAG, "Failed to start copper touch scanning");
            Deinitialize();
            return false;
        }
        scanning_ = true;

        ESP_LOGI(TAG, "Copper touch enabled on GPIO%d (channel %d)", TOUCH_PAD1,
                 TOUCH_PAD1);
        return true;
    }

    void Deinitialize()
    {
        if (sens_handle_ != nullptr) {
            if (scanning_) {
                touch_sensor_stop_continuous_scanning(sens_handle_);
                scanning_ = false;
            }
            if (enabled_) {
                touch_sensor_disable(sens_handle_);
                enabled_ = false;
            }
            if (chan_handle_ != nullptr) {
                touch_sensor_del_channel(chan_handle_);
                chan_handle_ = nullptr;
            }
            touch_sensor_del_controller(sens_handle_);
            sens_handle_ = nullptr;
        }

