LTG2012/xiaozhi-esp32-echoear/main/boards/echoear/EchoEar.cc
        if (task_handle_ != nullptr) {
            vTaskDelete(task_handle_);
            task_handle_ = nullptr;
        }

        if (event_queue_ != nullptr) {
            vQueueDelete(event_queue_);
            event_queue_ = nullptr;
        }
    }

private:
    enum class TouchEventType : uint8_t {
        kActive,
        kInactive,
    };

    struct TouchEvent {
        TouchEventType type;
    };

    static bool OnTouchActive(touch_sensor_handle_t sens_handle,
                              const touch_active_event_data_t* event,
                              void* user_ctx)
    {
        (void)sens_handle;
        (void)event;
        auto* self = static_cast<CopperTouchButton*>(user_ctx);
        return self != nullptr && self->PostEventFromIsr(TouchEventType::kActive);
    }

    static bool OnTouchInactive(touch_sensor_handle_t sens_handle,
                                const touch_inactive_event_data_t* event,
                                void* user_ctx)
    {
        (void)sens_handle;
        (void)event;
        auto* self = static_cast<CopperTouchButton*>(user_ctx);
        return self != nullptr &&
               self->PostEventFromIsr(TouchEventType::kInactive);
    }

    bool PostEventFromIsr(TouchEventType type)
    {
        if (event_queue_ == nullptr) {
            return false;
        }
        TouchEvent event = {.type = type};
        BaseType_t higher_priority_task_woken = pdFALSE;
        xQueueSendFromISR(event_queue_, &event, &higher_priority_task_woken);
        return higher_priority_task_woken == pdTRUE;
    }

    static void TaskFunction(void* arg)
    {
        auto* self = static_cast<CopperTouchButton*>(arg);
        if (self == nullptr || self->event_queue_ == nullptr) {
            vTaskDelete(nullptr);
            return;
        }

        TouchEvent event = {};
        while (xQueueReceive(self->event_queue_, &event, portMAX_DELAY) == pdTRUE) {
            self->HandleEvent(event);
        }
    }

    void HandleEvent(const TouchEvent& event)
    {
        int64_t now_ms = esp_timer_get_time() / 1000;
        if (event.type == TouchEventType::kActive) {
            if (!is_pressed_) {
                is_pressed_ = true;
                press_start_ms_ = now_ms;
            }
            return;
        }

        if (!is_pressed_) {
            return;
        }
        is_pressed_ = false;

        int64_t press_duration_ms = now_ms - press_start_ms_;
        if (press_duration_ms < kMinPressMs || press_duration_ms > kMaxPressMs) {
            return;
        }
        if (now_ms - last_trigger_ms_ < kTriggerCooldownMs) {
            return;
        }

        auto& app = Application::GetInstance();
        auto state = app.GetDeviceState();
        if (state == kDeviceStateIdle || state == kDeviceStateListening ||
            state == kDeviceStateSpeaking) {
            last_trigger_ms_ = now_ms;
            app.ToggleChatState();
            ESP_LOGI(TAG, "Copper touch toggled chat state (state=%d)", state);
        }
    }

    static constexpr int kCalibrationScanTimes = 5;
    static constexpr uint32_t kThresholdDivisor = 40;  // baseline / 40 = 2.5%
    static constexpr uint32_t kMinThreshold = 800;
    static constexpr int kEventQueueLength = 8;
    static constexpr int64_t kMinPressMs = 45;
    static constexpr int64_t kMaxPressMs = 1200;
    static constexpr int64_t kTriggerCooldownMs = 700;

    touch_sensor_handle_t sens_handle_ = nullptr;
    touch_channel_handle_t chan_handle_ = nullptr;
    QueueHandle_t event_queue_ = nullptr;
    TaskHandle_t task_handle_ = nullptr;

    bool enabled_ = false;
    bool scanning_ = false;
    bool is_pressed_ = false;
    int64_t press_start_ms_ = 0;
    int64_t last_trigger_ms_ = 0;
};
#endif  // SOC_TOUCH_SENSOR_SUPPORTED

class Cst816s : public I2cDevice {
public:
    struct TouchPoint_t {
        int num = 0;
        int x = -1;
        int y = -1;
    };

    enum TouchEvent {
        TOUCH_NONE,
        TOUCH_PRESS,
        TOUCH_RELEASE,
        TOUCH_HOLD
    };

    Cst816s(i2c_master_bus_handle_t i2c_bus, uint8_t addr) : I2cDevice(i2c_bus, addr)
    {
        read_buffer_ = new uint8_t[6];
        was_touched_ = false;
        press_count_ = 0;

        // Create touch interrupt semaphore
        touch_isr_mux_ = xSemaphoreCreateBinary();
        if (touch_isr_mux_ == NULL) {
            ESP_LOGE("EchoEar", "Failed to create touch semaphore");
        }
    }

    ~Cst816s()
    {
        delete[] read_buffer_;

        // Delete semaphore if it exists
        if (touch_isr_mux_ != NULL) {
            vSemaphoreDelete(touch_isr_mux_);
            touch_isr_mux_ = NULL;
        }
    }

    void UpdateTouchPoint()
    {
        ReadRegs(0x02, read_buffer_, 6);
        tp_.num = read_buffer_[0] & 0x0F;
        tp_.x = ((read_buffer_[1] & 0x0F) << 8) | read_buffer_[2];
        tp_.y = ((read_buffer_[3] & 0x0F) << 8) | read_buffer_[4];
    }

    const TouchPoint_t &GetTouchPoint()
    {
        return tp_;
    }

    TouchEvent CheckTouchEvent()
    {
        bool is_touched = (tp_.num > 0);
        TouchEvent event = TOUCH_NONE;

        if (is_touched && !was_touched_) {
            // Press event (transition from not touched to touched)
            press_count_++;
            event = TOUCH_PRESS;
            ESP_LOGI("EchoEar", "TOUCH PRESS - count: %d, x: %d, y: %d", press_count_, tp_.x, tp_.y);
        } else if (!is_touched && was_touched_) {
            // Release event (transition from touched to not touched)
            event = TOUCH_RELEASE;
            ESP_LOGI("EchoEar", "TOUCH RELEASE - total presses: %d", press_count_);
        } else if (is_touched && was_touched_) {
            // Continuous touch (hold)
            event = TOUCH_HOLD;
            ESP_LOGD("EchoEar", "TOUCH HOLD - x: %d, y: %d", tp_.x, tp_.y);
        }

        // Update previous state
        was_touched_ = is_touched;
        return event;
    }

    int GetPressCount() const
    {
        return press_count_;
    }

    void ResetPressCount()
    {
        press_count_ = 0;
    }

